package day0118;
// 주석 ( Comment )
// 주석이란 우리가 소스 파일 안에
// 적는 설명으로서 
// 실제 컴파일 단계에서는 
// 무시가 되는 글자들이다.
// 주석이 아닌 모든 것들은 코드로서
// 자바의 엄격한 문법에 어긋나지 않아야 하지만
// 실제 무시가 되기 때문에 우리가 문법을 안지켜줘도 된다!

// 주석은 주로 어떤 코드에 대한 설명을 적게 된다. 
// 해당 코드가 어떤 역할을 하는지, 왜 이렇게 적었는지 등에 대한 설명을 적어서
// 이 코드를 읽는 사람들에게 설명을 하는 역할을 한다.

// 주석에는 한줄 주석과 여러줄 주석 두가지 주석이 있다.
// 한줄 주석: //로 시작하고 그 다름칸부터 그줄이 끝날때까지가 주석이 된다.
// 여러줄 주석: /* 로 시작해서 */로 끝날 때 까지 그 사이의 모든 줄이 주석이 된다.

/*
 * 요
 * 렇
 * 게
 * 이클립스에서는 좀더 명확하게 주석인걸 표시하기 위해서
 * 여러줄 주석의 맨 앞에 * 을 붙여주지만
 * 지워도 상관 없다.
 * 
 * 작성자: 조재영
 * 작성일: 2021년 01월 18일
 * 프로그램 내용: 주석에 대한 설명과 예시
 * 굳이 위의 내용까지 적어줄 필요는 없지만
 * 어느정도 난이도가 있는 코드의 경우에는 반드시
 * 주석을 달아서 설명을 해야한다.
 */


public class Ex01Comment {
 
}


// public static void main(String[] args) { }
// -> 메인 메소드.
// -> 콘솔화면의 시작을 약속하는 문장
// -> 클래스의 시작. 프로그램의 시작.






