package Day0120;
// 사용자로부터 "자연수"만 입력 받는 프로그램.
// 만약 사용자가 자연수가 아닌 숫자를 입력하면?
// 자연수를 입력할 때까지 다시 입력을 받는다.

import java.util.Scanner;
public class Ex15While2 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        
        System.out.print("자연수를 입력하세요: ");
        int number = scanner.nextInt();
        
        while (number < 0) {
            System.out.print("자연수가 아닙니다. 다시 입력해주세요.");
            System.out.print("자연수를 입력하세요: ");
            number = scanner.nextInt();
        }
        
        //  이때 0은 0보다 작은가? 아니다. 그래서 false가 나오고 프로그램이 종료된다.
            
          
        scanner.close();    
    }
}

// 숙제 1: BMI 계산기를 만들어서 사용자의 BMI 수치와 현채 체중 상태를
//        출력하는 프로그램을 작성하시오.
//        단 사용자가 잘못된 키나 몸무게를 입력하면 올바른 값을 입력할 때까지
//        다시 입력을 받으세요.

// 숙제 2: 사용자로부터 점수를 입력 받아 A, B, C, D, F 를 출력한는 프로그램을
//        작성하세요. 단 잘못된 점수가 입력되면 올바른 점수가 입력될때까지
//        다시 입력을 받으세요

// 숙제 3: 사용자가 번호, 이름, 국어, 영어, 수학 점수를 입력하면
//        예쁘게 출력하는 프로그램을 작성하세요. 
//        단 사용자가 잘못된 형태의 점수를 입력하면 올바른 형태의 점수를 
//        입력할 때 까지 다시 입력을 받는 프로그램을 만드세요.

//예시)
//번호: 002번 이름: 조재영
//국어: 004점 영어: 002점 수학: 001점
//총점: 007점 평균: 02.33점

//   심화: 모든 숙제에 대해 하드코딩이 아닌 소프트코딩을 적용시키세요.



